# -*- coding: utf-8 -*-

import numpy as np

# # 打印一维矩阵或其单个元素
# a = np.array([0, 1, 2, 3, 4])
# b = np.array((0, 1, 2, 3, 4))  # 只能用于生成 1 维
# c = np.arange(5)  # 按顺序生成正整数序列
# d = np.linspace(0, 2*np.pi, 5)
#
# print(a)        # >>>[0 1 2 3 4]
# print(b)        # >>>[0 1 2 3 4]
# print(c)        # >>>[0 1 2 3 4]
# print(d)        # >>>[ 0.          1.57079633  3.14159265  4.71238898  6.28318531]
# print(a[3])     # >>>3


# 生成 n 维矩阵，打印矩阵即矩阵的子矩阵（包括单个元素）
a = np.array([[11, 12, 13, 14, 15],
              [16, 17, 18, 19, 20],
              [21, 22, 23, 24, 25],
              [26, 27, 28 ,29, 30],
              [31, 32, 33, 34, 35]])

print(a[2,4]) # >>>25
# MD slicing
print(a[0, 1:4]) # >>>[12 13 14]
print(a[1:4, 0]) # >>>[16 21 26]
print(a[::2,::2]) # >>>[[11 13 15]
                  # [21 23 25]
                  # [31 33 35]]
print(a[:, 1]) # >>>[12 17 22 27 32]