import numpy as np

# # 1D Array
# a = np.array([0, 1, 2, 3, 4])
# b = np.array((0, 1, 2, 3, 4))
# c = np.arange(5)
# d = np.linspace(0, 2*np.pi, 5)
#
# print(a)        # >>>[0 1 2 3 4]
# print(b)        # >>>[0 1 2 3 4]
# print(c)        # >>>[0 1 2 3 4]
# print(d)        # >>>[ 0.          1.57079633  3.14159265  4.71238898  6.28318531]
# print(a[3])     # >>>3


# # MD Array
# a = np.array([[11, 12, 13, 14, 15],
#               [16, 17, 18, 19, 20],
#               [21, 22, 23, 24, 25],
#               [26, 27, 28 ,29, 30],
#               [31, 32, 33, 34, 35]])
#
# print(a[2,4]) # >>>25
# # MD slicing
# print(a[0, 1:4]) # >>>[12 13 14]
# print(a[1:4, 0]) # >>>[16 21 26]
# print(a[::2,::2]) # >>>[[11 13 15]
#                   # [21 23 25]
#                   # [31 33 35]]
# print(a[:, 1]) # >>>[12 17 22 27 32]


# Array properties
# a = np.array([[11, 12, 13, 14, 15],
#               [16, 17, 18, 19, 20],
#               [21, 22, 23, 24, 25],
#               [26, 27, 28 ,29, 30],
#               [31, 32, 33, 34, 35]])

# print(type(a)) # >>><class 'numpy.ndarray'>
# print(a.dtype) # >>>int64
# print(a.size) # >>>25
# print(a.shape) # >>>(5, 5)
# print(a.itemsize) # >>>8
# print(a.ndim) # >>>2
# print(a.nbytes) # >>>200

# 行列式计算
# a = np.array([[1, 2],
#               [3, 1]])
#
# b = np.linalg.det(a)
#
# print(b)


# 矩阵乘法运算
# a = np.array([[0, 0, 3],
#               [0, 2, 0],
#               [1, 0, 0]])
# a = np.array([[0, 0, 0, 5],
#               [0, 0, 4, 0],
#               [0, 2, 0, 0],
#               [2, 0, 0, 0]])
# a = np.array([[0, 1, 2, 3, 0],
#               [0, 3, 4, 5, 0],
#               [0, 0, 2, 6, 0],
#               [0, 0, 0, 1, 0],
#               [0, 0, 0, 0, 0]])
# b = np.array([[1, 2],
#               [3, 1]])
# print(np.dot(a, b))

# c = np.dot(a, a)
# print(c, end='\n\n')
# print(np.dot(c, a))


# 求逆矩阵
a = np.mat([[0, -1],
              [2, 2]])
# a = np.mat([[0, 0, 3],
#               [0, 2, 0],
#               [1, 0, 0]])
# a = np.mat([[0, 0, 0, 5],
#               [0, 0, 4, 0],
#               [0, 2, 0, 0],
#               [2, 0, 0, 0]])
# a = np.mat([[0, 1, 2, 3, 0],
#               [0, 3, 4, 5, 0],
#               [0, 0, 2, 6, 0],
#               [0, 0, 0, 1, 0],
#               [0, 0, 0, 0, 0]])

# .T 转置
# .I 逆矩阵
# .H 共轭转置矩阵

print(a.I)

